{
  "education-title": {
    "fr": "Formation",
    "en": "Education"
  },
  "education-text": {
    "fr": "Durant mon passage à l'école 42, je me suis plongé en profondeur dans les subtilités de la programmation en C et du développement bas niveau. Cette expérience éducative unique a mis l'accent sur l'autonomie totale, me poussant à être autonome et ingénieux. Le programme a affiné mes compétences en résolution de problèmes et en pensée algorithmique, fournissant une base solide pour mes aventures ultérieures dans le domaine de la technologie.",
    "en": "During my time at 42 school, I delved deeply into the intricacies of C programming and low-level development. This unique educational experience emphasized complete autonomy, pushing me to be self-reliant and resourceful. The curriculum honed my skills in problem-solving and algorithmic thinking, providing a robust foundation for my subsequent ventures in technology."
  },
  "subtitle": {
    "fr": "🐍 Développeur Python | C | C++",
    "en": "🐍 Python | C | C++ Developer"
  },
  "skills-title": {
    "fr": "Compétences",
    "en": "Skills"
  },
  "skills-text": {
    "en": "In addition to my foundational training at 42 school, I've gained proficiency in a range of technologies and languages including C, C++, and Python. I'm well-versed in different operating systems like Linux, where I'm comfortable working with bash, as well as Windows and MacOS. Algorithmic design and implementation are also within my skill set, contributing to my flexibility as a developer. Importantly, I have a strong aptitude for learning new technologies and concepts, making me adaptable to the ever-evolving landscape of software development.",
    "fr": "En plus de ma formation de base à l'école 42, j'ai acquis une maîtrise d'une gamme de technologies et de langages, notamment le C, le C++ et le Python. Je suis également à l'aise avec différents systèmes d'exploitation comme Linux, où je suis confortable avec l'utilisation de bash, ainsi qu'avec Windows et MacOS. La conception et la mise en œuvre algorithmiques font également partie de mes compétences, contribuant à ma flexibilité en tant que développeur. J'ai une forte aptitude à apprendre de nouvelles technologies et concepts, ce qui me rend adaptable au paysage en constante évolution du développement logiciel."
  },
  "copy": {
    "fr": "Copier",
    "en": "Copy"
  }
}
