{
  "education-title": {
    "fr": "Formation",
    "en": "Education"
  },
  "education-text": {
    "fr": "Durant mon passage à l'école 42, je me suis plongé en profondeur dans les subtilités de la programmation en C et du\ndéveloppement bas niveau. Cette expérience éducative unique met l'accent sur l'autonomie totale, me poussant à être\nautonome et ingénieux. Le cursus a affiné mes compétences en résolution de problèmes et en pensée algorithmique,\nfournissant une base solide pour mes aventures ultérieures dans le domaine de la technologie.\nJ'ai pu y realiser de nombreux projets, du parcours de graphe en C jusqu'a l'initiation au web, en passant par une micro\nimplementation des containers STL de C++.",
    "en": "During my time at École 42, I delved deeply into the subtleties of C programming and low-level development. This unique educational experience places an emphasis on total autonomy, pushing me to be self-reliant and resourceful. The curriculum has sharpened my problem-solving skills and algorithmic thinking, providing a strong foundation for my later adventures in the field of technology. I was able to undertake numerous projects, from graph traversal in C to web development initiation, including a micro-implementation of C++ STL containers."
  },
  "subtitle": {
    "fr": "🐍 Développeur Python | C | C++",
    "en": "🐍 Python | C | C++ Developer"
  },
  "skills-title": {
    "fr": "Compétences",
    "en": "Skills"
  },
  "skills-text": {
    "en": "I've gained proficiency in a range of technologies and languages including C, C++, and Python. I'm well-versed in different operating systems like Linux, where I'm comfortable working with bash, as well as Windows and MacOS. Algorithmic design and implementation are also within my skill set, contributing to my flexibility as a developer. Importantly, I have a strong aptitude for learning new technologies and concepts, making me adaptable to the ever-evolving landscape of software development.",
    "fr": "J'ai acquis une maîtrise d'une large gamme de technologies et de langages, notamment le C, le C++ et le Python. Je suis\négalement à l'aise avec différents systèmes d'exploitation comme Linux, où je suis confortable avec l'utilisation de\nbash, ainsi qu'avec Windows et MacOS. La conception et la mise en œuvre algorithmiques font également partie de mes\ncompétences, contribuant à ma flexibilité en tant que développeur. J'ai une forte aptitude à apprendre de nouvelles\ntechnologies et concepts, ce qui me rend adaptable au paysage en constante évolution du développement logiciel."
  },
  "copy": {
    "fr": "Copier",
    "en": "Copy"
  },
  "corewar-legend": {
    "fr": "Projet Corewar de l'école 42.",
    "en": "42 school Corewar project."
  },
  "audio-title": {
    "fr": "Audio",
    "en": "Audio"
  },
  "audio-text": {
    "en": "In addition to my work as a developer, I am also a passionate musician with a particular interest in audio synthesis, especially modular, but also in sampling and beatmaking. It was through modular synthesis and software such as Reaktor that I turned to computer science. I also have formal training in sound techniques in recording studios, which enriches my skill set and allows me to blend technology and creativity.",
    "fr": "En plus de mon travail en tant que développeur, je suis également un musicien passionné avec un intérêt particulier pour la synthèse audio, modulaire en particulier, mais aussi pour le sampling et le beatmaking. C'est via la synthèse modulaire et des logiciels tels que Reaktor que je me suis tourné vers l'informatique. J'ai également une formation formelle en techniques du son en studio d'enregistrement, ce qui enrichit mon ensemble de compétences et me permet de mêler technologie et créativité."
  },
  "freelance-title": {
    "fr": "Freelance",
    "en": "Freelance"
  },
  "freelance-text": {
    "fr": "Je suis disponible pour des missions en freelance. Vous pouvez me retrouver sur Malt <a href=\"https://www.malt.fr/profile/renaudcepre\" target=\"_blank\" rel=\"noopener\"><img class=\"logo-in-text\" src=\"ressources/images/malt-svgrepo-com.svg\" alt=\"malt\"></a> où mon profil est à votre disposition pour plus de détails. Je propose des services de développement pour des durées variées, qu'il s'agisse de projets courts ou à long terme. Mon expertise s'étend du backend en Python, C et C++, aux architectures complexes et à la maintenance de systèmes. Si votre projet nécessite une solution full-stack, cette option est également envisageable. N'hésitez pas à me contacter pour un accompagnement professionnel sur vos projets.",
    "en": "I am available for freelance gigs. You can find me on Malt where my profile provides further details about my skills and services. I offer development services for both short-term and long-term projects. My expertise spans from backend development in Python, C, and C++, to intricate architecture and system maintenance. If your project requires a full-stack solution, that is also an option. Feel free to reach out for professional guidance on your projects."
  },
  "experience-title": {
    "fr": "Experience",
    "en": "Experience"
  },
  "experience-text": {
    "fr": "Fort d'une expérience variée, j'ai travaillé en tant que développeur back-end avec le Groupe Bernard et le Groupe Charles-André, principalement sur des projets Java en logistique et en gestion d'entreprise. Chez Markem-Imaje, j'ai, en plus de mon travail de développeur, endossé le rôle d'architecte, concevant une infrastructure de tests fonctionnels complexes en Python, ainsi qu'une API REST pour le monitoring de l'usage CPU/RAM sur des machines externes. J'ai également contribué à la maintenance, l'optimisation et la mise à jour d'une base de code en C++. Parallèlement à ces expériences professionnelles, j'ai travaillé sur des projets personnels, qui m'ont permis de me familiariser en profondeur avec Django, FastAPI, ou de découvrir la base de données Neo4J, NuxtJS et Docker, entre autres.",
    "en": "With a diverse range of experience, I've worked as a back-end developer with Groupe Bernard and Groupe Charles Andre, primarily focusing on Java projects in logistics and enterprise management. At Markem-Imaje, I took on the role of architect, designing a complex functional testing infrastructure in Python, as well as a REST API for monitoring CPU/RAM usage on external hardware. I've also contributed to the maintenance, optimization, and updating of a C++ codebase. Alongside these professional experiences, I have worked on personal projects that have deepened my familiarity with Django, FastAPI, the Neo4J database, NuxtJS, and Docker, among others."
  }
}

